import { Link } from "react-router-dom";

function HomePage() {
  return (
    <div className="grid">
      <section className="bg-dark p-4 mb-2 rounded">
        <h3>มารู้จักกับ ค่ายเส้นทางสู่หมอศิริราช</h3>
        <p>
          ค่ายเส้นทางสู่หมอศิริราช คือค่ายที่จัดทำโดยนักศึกษาแพทย์ศิริราช
          โดยมีจุดประสงค์เพื่อให้น้องๆ
          มัธยมศึกษาตอนปลายได้เข้ามารู้จักและสัมผัสกับคณะแพทยศาสตร์ศิริราชพยาบาล
          มหาวิทยาลัยมหิดลมากยิ่งขึ้น ทั้งในด้านหลักสูตรการเรียนการสอน
          กิจกรรมนอกหลักสูตรและ lifestyle ของนักศึกษาแพทย์ศิริราช
          รวมถึงเพื่อให้น้องๆ
          มัธยมศึกษาตอนปลายได้ใช้เป็นแนวทางการตัดสินใจเลือกศึกษาต่อในหลักสูตรแพทยศาสตรบัณฑิตในระดับชั้นอุดมศึกษาและประกอบอาชีพแพทย์ต่อไปในอนาคต
          ในปีนี้ค่ายของเราจัดขึ้นในวันเสาร์ที่ 7 และวันอาทิตย์ที่ 8 ธันวาคม
          2567 ที่คณะแพทยศาสตร์ศิริราชพยาบาลในรูปแบบค้างคืน
          ภายในค่ายประกอบด้วยกิจกรรมมากมายที่คัดสรรมาเป็นอย่างดีว่าน้องๆ
          มัธยมศึกษาตอนปลายจะได้รับประโยชน์สูงสุด เช่น การผ่า Gross anatomy,
          การใช้เครื่อง Ultrasound,
          รูปแบบการสอบซักประวัติและตรวจร่างกายในหลักสูตรแพทยศาสตร์บัณฑิตหรือ
          OSCE เป็นต้น
        </p>
      </section>
      <section className="bg-dark p-4 mb-2 rounded">
        <Link
          to="/signup"
          className="btn btn-primary"
        >
          สมัครเลย
        </Link>
      </section>
      <section className="bg-dark p-4 mb-2 rounded">
        <h3>คำเชิญชวน by President</h3>
        <p>
          “ สวัสดีน้องๆ มัธยมศึกษาตอนปลายทุกคน
          พี่ทั้งสองคนเป็นประธานค่ายเส้นทางสู่หมอศิริราชครั้งที่ 25 นะครับ/ค่ะ
          ในปีนี้ค่ายเส้นทางฯ ของเรากลับมาพร้อมกับ concept Inside out
          ที่จะทำให้น้องๆ ได้เข้าถึงอารมณ์และความรู้สึกของตัวเองมากขึ้น
          ตั้งแต่เริ่มต้นจากเด็กนักเรียนคนหนึ่งที่มีความฝันในการเรียนหมอ
          จนเข้ามาสัมผัสกับชีวิตของนักศึกษาในคณะแพทย์แล้วมีอารมณ์ความรู้สึกเปลี่ยนแปลงไปอย่างไร
          จะสนุกหรือเหนื่อยยากอย่างที่คาดไว้หรือไม่ ทั้งนี้น้องๆ
          จะได้รับทั้งข้อคิด ความรู้ และแรงบันดาลใจ
          ผ่านกิจกรรมภายในค่ายมากมายที่พี่ๆ
          ในคณะแพทยศาสตร์ศิริราชพยาบาลตั้งใจจัดเตรียมขึ้นมาเพื่อน้องๆ
          มัธยมศึกษาตอนปลายทุกคน สุดท้ายนี้เตรียมเอกสารการสมัครให้พร้อม
          แล้วมาเจอกันที่ค่ายเส้นทางสู่หมอศิริราชครั้งที่ 25 นะครับ/ค่ะ :)) ” -
          Great & Ingfa SI132
        </p>
      </section>
      <section>
        <h3>กำหนดการ</h3>
        <p></p>
      </section>
    </div>
  );
}

export default HomePage;
